Oxlip/cc2538-firmware/apps/astral-firmware/aura.c
/* Instantaneous Power: This resource type returns the instantaneous power
 *    of a load as a Decimal value in W.
 */
#define DEFINE_IPSO_COAP_PWR_WATT_NODE(num)                                                     \
  EVENT_RESOURCE(coap_power_watts_##num, METHOD_GET, "dev/pwr/" #num "/w",                      \
                    "title=\"Instantaneous Power " #num "\";rt=\"ipso.pwr.w\"");                \
                                                                                                \
  void                                                                                          \
  coap_power_watts_##num##_handler(void* request, void* response,                               \
                                   uint8_t *buffer, uint16_t preferred_size,                    \
                                   int32_t *offset)                                             \
  {                                                                                             \
    char content[12];                                                                           \
    int length;                                                                                 \
    double current = get_cs_value(CS_VALUE_TYPE_RMS_CURRENT, num);                              \
                                                                                                \
    length = snprintf(content, sizeof(content), "%d", (int) current);                           \
    memcpy(buffer, content, length);                                                            \
    REST.set_header_content_type(response, REST.type.TEXT_PLAIN);                               \
    REST.set_header_etag(response, (uint8_t *) &length, 1);                                     \
    REST.set_response_payload(response, buffer, length);                                        \
  }                                                                                             \
                                                                                                \
  void                                                                                          \
  coap_power_watts_##num##_event_handler(resource_t  *r){                                       \
      coap_packet_t notification[1];                                                            \
      double current;                                                                           \
      char content[12];                                                                         \
      int length;                                                                               \
      static uint16_t event_counter = 0;                                                        \
                                                                                                \
      coap_init_message(notification, COAP_TYPE_NON, REST.status.OK, 0);                        \
      current = get_cs_value(CS_VALUE_TYPE_RMS_CURRENT, num);                                   \
      length = snprintf(content, sizeof(content), "%d", (int) current);                         \
      coap_set_payload(notification, content, length);                                          \
      REST.notify_subscribers(r, event_counter++, notification);                                \
  }                                                                                             \

/* Cumulative Power: This resource type returns the cumulative power of
 *  a load as a Decimal value in kWh. The value SHOULD be set to zero
 *  on initialization, however the value may be saved and retrieved
 *  from non-volatile memory.
 */
#define DEFINE_IPSO_COAP_PWR_KWATT_NODE(num)                                                    \
  EVENT_RESOURCE(coap_power_kwatts_##num, METHOD_GET, "dev/pwr/" #num "/kw",                    \
           "title=\"Cumulative Power " #num "\";rt=\"ipso.pwr.kw\";obs");                       \
                                                                                                \
  void                                                                                          \
  coap_power_kwatts_##num##_handler(void* request, void* response,                              \
                                   uint8_t *buffer, uint16_t preferred_size,                    \
                                   int32_t *offset)                                             \
  {                                                                                             \
    char content[12];                                                                           \
    int length;                                                                                 \
    double current = get_cs_value(CS_VALUE_TYPE_RMS_CURRENT, num);                              \
                                                                                                \
    length = snprintf(content, sizeof(content), "%d", (int) current);                           \
    memcpy(buffer, content, length);                                                            \
    REST.set_header_content_type(response, REST.type.TEXT_PLAIN);                               \
    REST.set_header_etag(response, (uint8_t *) &length, 1);                                     \
    REST.set_response_payload(response, buffer, length);                                        \
  }                                                                                             \
                                                                                                \
  void                                                                                          \
  coap_power_kwatts_##num##_event_handler(resource_t  *r){                                      \
      coap_packet_t notification[1];                                                            \
      double current;                                                                           \
      char content[12];                                                                         \
      int length;                                                                               \
      static uint16_t event_counter = 0;                                                        \
                                                                                                \
      coap_init_message(notification, COAP_TYPE_NON, REST.status.OK, 0);                        \
      current = get_cs_value(CS_VALUE_TYPE_RMS_CURRENT, num);                                   \
      length = snprintf(content, sizeof(content), "%d", (int) current);                         \
      coap_set_payload(notification, content, length);                                          \
      REST.notify_subscribers(r, event_counter++, notification);                                \
  }                                                                                             \

