Oxlip/cc2538-firmware/apps/astral-firmware/aura.c
/*
 * A helper function to dump all sensor information.
 */
static void
print_sensor_information()
{
#ifndef USING_CC2538DK
  float current_ma, temperature;
  temperature = get_temperature();
  current_ma = get_cs_value(CS_VALUE_TYPE_RMS_CURRENT, 0);
  PRINTF("Internal Vdd=%dmV RMS_IA=%d ACTIVE_WATT=%d RMS_VOLTAGE=%d\n",
         (int)get_vdd(),
         (int)current_ma,
         (int)get_cs_value(CS_VALUE_TYPE_ACTIVE_WATT, 0),
         (int)get_cs_value(CS_VALUE_TYPE_RMS_VOLTAGE, 0)
         );
#endif
}

/*
 * Handle button press event. When user presses a switch it is generated as an
 * interrupt which is handled by an ISR which generates an button_event.
 * This button event is handled by the main loop(astal_coap_server).
 */
static void
handle_button_press(int button_number)
{
  int dim_percent = 0;
  static int btn_press_cnt[] = {0, 0, 0, 0};

  dim_percent = 100 - ((++btn_press_cnt[button_number] % 5) * 25);

  printf("Button pressed %d dimming to %d\n", button_number, dim_percent);
  if (dim_percent == 0) {
    dimmer_disable(button_number);
  } else {
    dimmer_enable(button_number, dim_percent);
  }
}


/*-----------------Main Loop / Process -------------------------*/

PROCESS(astral_coap_server,  COMPANY_NAME PRODUCT_MODEL_NAME " CoAP server");
PROCESS(periodic_timer_process, "Peridic timer process for testing");
AUTOSTART_PROCESSES(&astral_coap_server, &periodic_timer_process);

PROCESS_THREAD(astral_coap_server, ev, data)
{
  PROCESS_BEGIN();

  PRINTF("%s %s %s %s\n", COMPANY_NAME, PRODUCT_MODEL_NAME, __DATE__, __TIME__);

  PRINTF("RF channel: %u\n", CC2538_RF_CONF_CHANNEL);
  PRINTF("PAN ID: 0x%04X\n", IEEE802154_PANID);

  PRINTF("uIP buffer: %u\n", UIP_BUFSIZE);
  PRINTF("LL header: %u\n", UIP_LLH_LEN);
  PRINTF("IP+UDP header: %u\n", UIP_IPUDPH_LEN);
  PRINTF("REST max chunk: %u\n", REST_MAX_CHUNK_SIZE);

  /* Initialize the REST engine. */
  rest_init_engine();

  /* Activate the CoAP resources. */
  rest_activate_resource(&resource_coap_dev_mfg);
  rest_activate_resource(&resource_coap_dev_mdl);
  rest_activate_resource(&resource_coap_dev_mdl_hw);
  rest_activate_resource(&resource_coap_dev_mdl_sw);
  rest_activate_resource(&resource_coap_dev_ser);
  rest_activate_resource(&resource_coap_dev_n);
  rest_activate_resource(&resource_coap_dev_pwr);
  rest_activate_resource(&resource_coap_dev_pwr_v);
  rest_activate_resource(&resource_coap_uptime);
  rest_activate_resource(&resource_coap_power_dimmer_0);
  rest_activate_resource(&resource_coap_power_dimmer_1);
  rest_activate_resource(&resource_coap_power_dimmer_2);
  rest_activate_resource(&resource_coap_power_dimmer_3);

#define ACTIVATE_IPSO_COAP_PWR_NODE(num)                                              \
  rest_activate_event_resource(&resource_coap_power_watts_##num);                     \
  rest_activate_event_resource(&resource_coap_power_kwatts_##num);                    \
  rest_activate_resource(&resource_coap_power_relay_##num);                           \
  rest_activate_resource(&resource_coap_power_dimmer_##num);                          \

  ACTIVATE_IPSO_COAP_PWR_NODE(0);
  ACTIVATE_IPSO_COAP_PWR_NODE(1);
  ACTIVATE_IPSO_COAP_PWR_NODE(2);
  ACTIVATE_IPSO_COAP_PWR_NODE(3);

  rplinfo_activate_resources();
  rest_activate_resource(&resource_coap_radio);

  ota_update_enable();

  /* Handle events */
  while(1) {
    PROCESS_WAIT_EVENT();
    if (ev == PROCESS_EVENT_TIMER) {
       PRINTF("Timer event - and we havent configured one\n");
    } else {
      if (ev == sensors_event) {
        if (data == &button1_sensor) {
           handle_button_press(0);
        } else if (data == &button2_sensor) {
           handle_button_press(1);
        } else if (data == &button3_sensor) {
           handle_button_press(2);
        } else if (data == &button4_sensor) {
           handle_button_press(3);
        }
      }
    }
  } /* while (1) */

  PROCESS_END();
}


static struct etimer et;
PROCESS_THREAD(periodic_timer_process, ev, data)
{
  PROCESS_BEGIN();

  etimer_set(&et, CLOCK_SECOND * 2);
  while(1) {
    PROCESS_WAIT_EVENT();
    if(ev == PROCESS_EVENT_TIMER) {
      print_sensor_information();

      /* Notify uHub about current consumption. */
      coap_power_kwatts_0_event_handler(&resource_coap_power_kwatts_0);
      coap_power_kwatts_1_event_handler(&resource_coap_power_kwatts_1);
      coap_power_kwatts_2_event_handler(&resource_coap_power_kwatts_2);
      coap_power_kwatts_3_event_handler(&resource_coap_power_kwatts_3);

      /* reset the timer so that it will fire again */
      etimer_reset(&et);
    }
  }

  PROCESS_END();
}
